create database car_insurance; 
use car_insurance;
select * from car_ins_com;	-- 자동차 보험 회사 정보, 총 12 row
select * from car_ins; 		-- 자동차 보험 할인 특약 정보, 총 431 row

select count(*) from car_ins;

#### car_ins_com 회사명 전처리 // Parent 12개의 row 처리
update	car_ins_com 
set 	회사명 = replace(회사명, '주식회사', '')
where	회사명 like '%주식회사';
####

#### car_ins 회사명 전처리 // children 캐롯 21개를 제외한 410개의 row 처리
update car_ins
set 회사명 = case
	when 회사명 = '삼성화재' then '삼성화재해상보험'
    when 회사명 = '흥국화재' then '흥국화재해상보험'
    when 회사명 like '%손보' then replace(회사명, '손보', '손해보험')
    when 회사명 like '%화재' then replace(회사명, '화재', '화재보험')
    when 회사명 like '%해상' then replace(회사명, '해상', '해상화재보험')
    else 회사명
end
where 회사명 like '%손보' or 회사명 like '%화재' or 회사명 like '%해상' or 회사명 = '삼성화재보험' or 회사명 = '흥국화재보험';
####

#### 전처리 해줘야하는 row 416개. 가입조건 중복된 부분 삭제, 생략된 부분 추가 
## 412row 변경
update 	car_ins
set		가입조건 = case
		when 가입조건 like "%다음의%" then replace(가입조건, '다음의 조건 모두 해당하는 경우에 한하여 가입 가능', '')
        when 가입조건 like '%(상동)%' then replace(가입조건, '(상동)', '▶① 기명피보험자가 국민기초생활보장법 제2조에 의거한 기초생활수급자인 경우② 기명피보험자 또는 기명피보험자의 동거가족이 장애인복지법에 따른  장애인등록증 상 장애 정도가 ‘중증’인 경우 (2019. 6. 30. 이전 발급된 장애인등록증의 경우는 1-3급 장애인)가 아닐 경우 다음의 조건을 모두 충족하는 경우가. 기명피보험자의 나이가 가입시점 만 30세 이상나. 피보험자동차가 비사업용으로 배기량이 1,600cc 이하 승용자동차 이거나 1.5톤 이하의 화물자동차 (단, 기명피보험자가 소유한 자동차는 1대)다. 피보험자동차가 최초등록일로부터 5년 이상 경과라. 기명피보험자에게 만20세 미만의 부양자녀가 있을 것 (단, 기명보험자의 나이가 가입시점 만 65세 이상이고 기명피보험자 및 배우자의 합산 소득이 연 2,000만원 이하 경우는 제외)마. 기명피보험자 및 배우자의 합산 소득이 연 4,000만원 이하③ 기명피보험자 또는 기명피보험자의 동거가족이 장애인복지법에 따른  장애인등록증 상 장애 정도가 ‘중증’인 경우 (2019. 6. 30. 이전 발급된 장애인등록증의 경우는 1-3급 장애인)로서 다음의 조건을 모두 충족하는 경우가. 피보험자동차가 비사업용으로 배기량이 2,000cc 이하 승용자동차 이거나 1.5톤 이하의 화물자동차 (단, 기명피보험자가 소유한 자동차는 1대)나. 피보험자동차가 최초등록일로부터 5년 이상 경과다. 기명피보험자 및 배우자의 합산소득이 연 4,000만원 이하④ 기명피보험자 및 배우자의 합산 소득이 연 4,000만원 이하이면서, 피보험자동차가 장애인 운송용 휠체어 리프트나 슬로프가 설치되어 출고되거나 구조변경된 차량인 경우')
		when 가입조건 like '%상동%' then replace(가입조건, '상동', '▶① 기명피보험자가 국민기초생활보장법 제2조에 의거한 기초생활수급자인 경우② 기명피보험자 또는 기명피보험자의 동거가족이 장애인복지법에 따른  장애인등록증 상 장애 정도가 ‘중증’인 경우 (2019. 6. 30. 이전 발급된 장애인등록증의 경우는 1-3급 장애인)가 아닐 경우 다음의 조건을 모두 충족하는 경우가. 기명피보험자의 나이가 가입시점 만 30세 이상나. 피보험자동차가 비사업용으로 배기량이 1,600cc 이하 승용자동차 이거나 1.5톤 이하의 화물자동차 (단, 기명피보험자가 소유한 자동차는 1대)다. 피보험자동차가 최초등록일로부터 5년 이상 경과라. 기명피보험자에게 만20세 미만의 부양자녀가 있을 것 (단, 기명보험자의 나이가 가입시점 만 65세 이상이고 기명피보험자 및 배우자의 합산 소득이 연 2,000만원 이하 경우는 제외)마. 기명피보험자 및 배우자의 합산 소득이 연 4,000만원 이하③ 기명피보험자 또는 기명피보험자의 동거가족이 장애인복지법에 따른  장애인등록증 상 장애 정도가 ‘중증’인 경우 (2019. 6. 30. 이전 발급된 장애인등록증의 경우는 1-3급 장애인)로서 다음의 조건을 모두 충족하는 경우가. 피보험자동차가 비사업용으로 배기량이 2,000cc 이하 승용자동차 이거나 1.5톤 이하의 화물자동차 (단, 기명피보험자가 소유한 자동차는 1대)나. 피보험자동차가 최초등록일로부터 5년 이상 경과다. 기명피보험자 및 배우자의 합산소득이 연 4,000만원 이하④ 기명피보험자 및 배우자의 합산 소득이 연 4,000만원 이하이면서, 피보험자동차가 장애인 운송용 휠체어 리프트나 슬로프가 설치되어 출고되거나 구조변경된 차량인 경우')
        else 가입조건
end
where 가입조건 like "%상동%" or 가입조건 like "%다음의%";

## 3 row 변경
update	car_ins
set 	가입조건 = case
        when 가입조건 like "%다음의 조건 모두 해당하는 경우에 한하여 가입%" then replace(가입조건, '다음의 조건 모두 해당하는 경우에 한하여 가입', '')
        when 가입조건 like "%다음의 조건 1~4%" then replace(가입조건, '다음의 조건 1~4 중 하나에 해당하는 경우 가입 가능', '')
        else 가입조건
        end;
        
## 1 row 변경
update car_ins 
set 가입조건 = replace(가입조건, ' 다음의 조건 ①~④ 중 하나에 해당하는 경우 가입 가능', '')
where 가입조건 like '%다음의%';
####

update	car_ins
set		가입조건 = replace(가입조건, '~', '-')
where	가입조건 like '%~%';

#### 컬럼명 할인율(%)acsdesc -> 할인율(%)로 변경
ALTER TABLE car_ins
CHANGE `할인율(%)ascdesc` `할인율(%)` DOUBLE;
#### 컬럼명 적용담보 변경
ALTER TABLE car_ins
CHANGE `적용담보(자동차상해 및담보별 확장특약 포함기준)` `적용담보` text;
####


#### my sql에서는 blob 또는 text type의 길이를 정해주지 않으면 컬럼을 pk로 등록하지 못함.
#### type 변경 후  pk로 등록 
alter table car_ins_com modify 회사명 varchar(10);

alter table car_ins_com add primary key(회사명);
####
#### type 변경 후 fk로 등록
alter table car_ins modify 회사명 varchar(10);

alter table car_ins add constraint car_ins_fk foreign key (회사명) references car_ins_com(회사명);
####



